CaseLabGreenatom/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <type>
      <types>CatalogRef.ЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Изменил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемУпаковки</name>
    <type>
      <types>DefinedType.Количество</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>EnumRef.СтавкиНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Ингредиенты</name>
    <attributes>
      <name>Продукт</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

CaseLabGreenatom/src/InformationRegisters/Изображения/Изображения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Изображения</name>
  <resources>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

CaseLabGreenatom/src/Enums/ТипНоменклатуры/ТипНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипНоменклатуры</name>
  <enumValues>
    <name>Блюдо</name>
  </enumValues>
  <enumValues>
    <name>Продукт</name>
  </enumValues>
  <enumValues>
    <name>РасходныйМатериал</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
</mdclass:Enum>

CaseLabGreenatom/src/Catalogs/Номенклатура/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
 Изображение = "";
 
 ЗначениеКлюча = Новый Структура;
 ЗначениеКлюча.Вставить("Номенклатура", Объект.Ссылка);
 
 ЗаписьВРегистр = РегистрыСведений.Изображения.СоздатьКлючЗаписи(ЗначениеКлюча);
 
 Изображение = ПолучитьНавигационнуюСсылку(ЗаписьВРегистр, "Изображение", 0);
 
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	МенеджерЗаписи = РегистрыСведений.Изображения.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Номенклатура = Объект.Ссылка;
	
	Если ЭтоАдресВременногоХранилища(Изображение) Тогда
		
		ДвоичнвеДанные = ПолучитьИзВременногоХранилища(Изображение);
		
		МенеджерЗаписи.Изображение = Новый ХранилищеЗначения(ДвоичнвеДанные); 
		МенеджерЗаписи.Записать();
		
	ИначеЕсли Изображение = "" Тогда
		
		МенеджерЗаписи.Фото = Новый ХранилищеЗначения(Неопределено);
		МенеджерЗаписи.Записать();
		
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ТипНоменклатурыПриИзменении(Элемент)

	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипНоменклатуры.Блюдо") Тогда
		
		Элементы.Ингредиенты.Видимость = Истина;
		
	Иначе
		
		Элементы.Ингредиенты.Видимость = Ложь;
		
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипНоменклатуры.Блюдо") И ЗначениеЗаполнено(Объект.Ингредиенты) Тогда
		
		Отказ = Истина;
		Сообщить("Нельзя заполнить вкладку ""Ингредиенты"" для расходного материала, ингридиента или услуги! 
				|Очистите вкладку ""Ингредиенты"" или выберите тип ""Готовый продукт""."); 
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если Объект.Тип = ПредопределенноеЗначение("Перечисление.ТипНоменклатуры.Блюдо") Тогда
		
		Элементы.Ингредиенты.Видимость = Истина;
		
	Иначе
		
		Элементы.Ингредиенты.Видимость = Ложь;
		
	КонецЕсли	
	
КонецПроцедуры

#КонецОбласти  

#Область ОбработчикиСобытийЭлементовТаблицыФормыИнгредиенты

 &НаКлиенте
Процедура ИнгредиентыПродуктОбработкаВыбора(Элемент, ВыбранноеЗначение, ДополнительныеДанные, СтандартнаяОбработка)
	
	ЕдиницаИзмерения = ЕдиницаИзмеренияНаСервере(ВыбранноеЗначение);
	
	ТекущаяСтрока = Элементы.Ингредиенты.ТекущиеДанные;
	
	ТекущаяСтрока.ЕдиницаИзмерения = ЕдиницаИзмерения;

КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзображение(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузкаИзображения", ЭтотОбъект);
	НачатьПомещениеФайлаНаСервер(Оповещение, , , , , УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ЗагрузкаИзображения(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		
		Возврат
		
	КонецЕсли;
	
	Изображение = Результат.Адрес;
	
КонецПроцедуры 

&НаКлиенте
Процедура УдалитьИзображение(Команда)
	
	Изображение = "";
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЕдиницаИзмеренияНаСервере(ВыбранноеЗначение)
	
      ЕдиницаИзмерения = ВыбранноеЗначение.ЕдиницаИзмерения;
	  
	  Возврат ЕдиницаИзмерения;

КонецФункции

 #КонецОбласти
